[
	{
		"id": 94,
		"title": "Testing",
		"content": "Doing the test thing.",
		"date": "2023-05-07T01:23:59",
		"comments": []
	},
	{
		"id": 93,
		"title": "Testing... testing... everything seems to be in order.",
		"content": "Alright Gordon, your suit should keep you comfortable through all this. The specimen will be delivered to you in a few moments. If you would be so good as to climb up and start the rotors, we can bring the Anti-Mass Spectrometer to 80% and hold it there until the carrier arrives.",
		"date": "2023-05-07T00:00:00",
		"comments": []
	},
	{
		"id": 92,
		"title": "A flaming update",
		"content": "<h3>Aaa-tention!</h3>\nWe're about a month away from summer, which means it's time for yet another piping-hot site update.\nBut this isn't just a one time thing. There will be not one, not two, but FOUR (or maybe five... or six) WHOLE SITE UPDATES in a year every season, filled with new features and pages, design updates, and who knows what else?!?!\nHowever, to make it even better, I need suggestions, YOUR suggestions specifically. Let me know what you want to be added or fixed, or even submit the changes yourself!\nSo prepare your sunscreen, shades, and Pepto Bismol from your amusement park trip, for this yet-to-be-named, probably not summer-themed-but-instead-suitated update!",
		"date": "2023-05-05T00:00:00",
		"comments": []
	},
	{
		"id": 91,
		"title": "Internet woes",
		"content": "You may have noticed some services have been offline for an extended period of time.\nDue to internal issues relating to my ISP being shitty, I am temporarily using another server (provided by <a href=https://dkay.xyz>dkay</a>) until that is resolved.\nThis issue should be resolved soon, but hopefully no later than 2023-05-11.\n<h3>LONG VERSION:</h3>\n<h4>Cablelynx - Giving Comcast a run for it's money</h4>\nMy ISP has been known to me to be shitty for a while. However, it seems they have raised the stakes on the shit scale 5-fold in the last 2-3 months.\nUptimes are extremely shitty, it's been up less often than it hasn't, and it's WAYY overpriced for what I'm getting. Personally, I don't think $400 a month for 250mbps down/20mbps up internet that barely works is worth it. But, it's not completely the issue.\n<h4>Bill bloat</h4>\nUpon further research, it seems that it's actually the Cable TV we don't use that has been inflating the bill. So one of these actions will be what happens:\n<ul>\n<li>We keep this ISP, pay the current bill, then take off the Cable TV, then keep that until Woodruff (another local ISP, but actually good) is avaliable in our area</li>\n<li>We use mobile hotspots for internet until AT&T is avaliable in our area, which should happen no sooner or later than May 11, 2023</li>\n<li>We say fuck it and go amish :P</li>\n</ul>\nBut yeah. There's your reason why shit's been down over the past week (and will contine to be so for a while, most likely.)",
		"date": "2023-04-24T00:00:00",
		"comments": []
	},
	{
		"id": 90,
		"title": "Free-falling display",
		"content": "My monitor broke due to excellent engineering on Sceptre's part.\nThe stand just randomly gave out and my monitor fell over while I was asleep, so I have to go back to using my TV as a secondary monitor for now. Fuck.",
		"date": "2023-04-13T00:00:00",
		"comments": []
	},
	{
		"id": 89,
		"title": "Tornado",
		"content": "Sorry about the long down-time. My city took a direct hit from an intense tornado on 2023-03-31.\nDue to the following, the April Fools 2023 event has been cancelled.",
		"date": "2023-04-03T00:00:00",
		"comments": []
	},
	{
		"id": 88,
		"title": "Severe weather - Might go down",
		"content": "Due to intense severe weather in my area that is expected later today, HIDNet may be down for several days/weeks.\nThe first high risk for my area since 2011 has been issued, see below:\n <br><br> <img class=img2 src=/static/blog/2023-03-31/image.gif>",
		"date": "2023-03-31T00:00:00",
		"comments": []
	},
	{
		"id": 87,
		"title": "Cloud Nine Update",
		"content": "The Cloud Nine Update has arrived!\nFeaturing a near-total rewrite of the site (both front and back), a new, no-longer-relying-on-a-service-that-may-or-may-not-be-good, <a href=/guestbook>Guestbook</a>, as well as a bunch of other new goodies!\nInfact, the update is so huge that I utilized this fancy-shmancy new thing to annoucne it, called a \"blog post\". An all new, revolutonary technology that lets people \"speak\" or write about what's on their mind. You may have heard of it, but trust me, it's brand-spanking new (not really), and innovative (possibly).\nAnyway, enjoy!",
		"date": "2023-03-24T00:00:00",
		"comments": []
	},
	{
		"id": 86,
		"title": "THE GREAT DATA LOSS OF 2023 - DETAILS:",
		"content": "On Mar 9, 2023, I made a stupid mistake.\nI was preparing a Linux flash drive to install to a computer I had lying around. However, the Linux install I had on my main laptop, unknowingly to me at first, switched the paths of my OS flash drive, and my external HDD, which houses almost all of my important data (including but not limited to the VM keys).\nSo basically, the drive's partition table was nuked. I quickly realized it, and stopped the flashing, but the damage had been done.\nThroughout the day, I had attempted to recover the data, to no avail.\nTherefore, I lost about 1TB of data, just from a stupid mistake that could've been mitigated by running <code>lsblk</code>. I am officially a donut.\nWell, that's how you learn, I guess.\nThis explains the ~12 hour long downtime today. There is no easy way to decrypt a LUKS volume if you lost the key (unlike with Bitlocker on Windows), so I had to reinstall the OSes in the Linux VMs.\nI am extremely sorry for this and I'll take steps to make sure this never, <em>ever</em> happens again.",
		"date": "2023-03-11T00:00:00",
		"comments": []
	},
	{
		"id": 85,
		"title": "A new design!",
		"content": "A redesign for this website is being worked on. A W.I.P. version can be found under the <a href=https://github.com/HIDEN64/hidens-website/tree/redesign-2023>redesign-2023 branch</a> on the repository.\nPlease test it and give feedback! To give feedback, <a href=/about/socials>contact me</a> or use the guestbook.\nNOTE: The current design on said branch may not be repersentivve of the final design once the update came out, and is subject to any change, of any size, at any time. Consider it experiemental until I say it isn't.",
		"date": "2023-03-06T00:00:00",
		"comments": []
	},
	{
		"id": 84,
		"title": "",
		"content": "Oh- and one more thing:\nI'm gathering feedback about this website and what everyone wants to see changed right now.\nWhat I <em>won't</em> do: Anything that requires a substantial layout/code-base change across the entire website, this includes (but is not limited to) mobile optimization\nWhat I <em>will</em> do: Everything else!\nYou can submit feedback by using the Guestbook or contacting me at one of <a href=/about/socials>these services</a>.",
		"date": "2023-02-23T00:00:00",
		"comments": []
	},
	{
		"id": 83,
		"title": "Twitter account retired, new VM",
		"content": "My Twitter account has been officially retired. My only active account now is for HIDNet updates only, which will also be retired by sometime within the next year.\nFor HIDNet updates + everything else, go follow @hiden@mstdn.social on the Fediverse (specifically Mastodon, using the mstdn.social instance) instead.\nAlso for a HIDNet update, NET5 has been created. It runs Ubuntu 22.04, and primiarily serves to host messaging/chat/communications/whatever you want to call it services. My main focuses for it right now are IRC and Matrix, which should be fully avaliable by the end of Q1 2023.",
		"date": "2023-02-23T00:00:00",
		"comments": []
	},
	{
		"id": 82,
		"title": "Horny diabeetus day",
		"content": "Happy Valentines day.\nTo those without a SO, hope you have a good day regardless.\nI also completely switched to Linux (for real this time (get japed - HIDEN, May 7, 2023)). Haven't looked back since.",
		"date": "2023-02-14T00:00:00",
		"comments": []
	},
	{
		"id": 81,
		"title": "NVIDIA sucks",
		"content": "Alright, so I had to go back to Windows because NVIDIA hates Linux.\nEvery time I switch TTYs and then go back to the one running X, the DE becomes a clusterfuck of visual gitches, optimus is a pain in the ass, the latest driver is bugged with Source Engine games, etc.\nSo for now, I'm sticking with Windows. Sucks, but I have to, to actually have a working system.",
		"date": "2023-01-29T00:00:00",
		"comments": []
	},
	{
		"id": 80,
		"title": "Behold! The encryptioninator!",
		"content": "Apologies about the down-time. I was doing a little encryptification-ination. Basically, I had to reinstall the OS on all Linux VMs on my server because I didn't feel like going through the hell that is retroactively setting up LVM to set up LUKS.\nSo yeah, LUKS and Bitlocker are re-enabled on all VMs. I wrote the decryption keys down somewhere this time, so what happened months ago won't happen again, I promise!\nFor the SRCDS VM, it now uses VBS+HVCI for more even more sehcorities.\n<s>Also, I fully switched from Windows to Linux on my daily driver... with some speed bumps of course (because fuck you NVIDIA).</s>\nTLDR: Server VMs are now encrypted and the Windows one now uses VBS+HVCI for sehcorities improvements, <s>I switched to Linux on my daily driver.</s>",
		"date": "2023-01-29T00:00:00",
		"comments": []
	},
	{
		"id": 79,
		"title": "New year - 2023",
		"content": "It is now 2023 in UTC. Hopefully this year won't be as mid as last year.\nSo uh, yeah, 2022 was a complete rollercoaster for me personally. I finally put some effort into improving my mental health, which has gone into the gutter after 2021 (and again around mid-2022), and it has worked extremely well.\nI also got a new PC, rewritten the backend to this site (although that was done toward the ends of 2021, although it was very unpolished then), launched a new server setup, found out I had GAD, and improved my skills with tech tremendously. Although some really shitty shit happened this year too, that I don't want to get into, so I guess it balances out.\nSo yeah, I hope 2023 is a way better year for all of us. the last 3 have been a complete trainwreck through and through, although, for me personally, 2022 also had a lot of bright spots. Hopefully the bullshit gets cut down.",
		"date": "2023-01-01T00:00:00",
		"comments": []
	},
	{
		"id": 78,
		"title": "Gender moment",
		"content": "Well, I'm not nonbinary. I'm transfem (use she/her). I feel most comfortable like that. I think the \"not feeling feminine\" thing was just a phase/thing in the moment, because I got some very heavy gender envy earlier, and have been for the past day or 2.\nTLDR: I'm transfem again, and will stay that way.",
		"date": "2022-12-28T00:00:00",
		"comments": []
	},
	{
		"id": 77,
		"title": "Me being an idiot",
		"content": "Apologies about the downtime earlier this week. I was a dumbass and forgot the LUKS password to my Linux VMs, so I had to reinstall the OSes on them.\nMy HDD cable died a few days ago as well, which means I couldn't update the site because the source code is stored on there. I got a replacement cable earlier today however.\nThat's about it for now, another post is probably coming on Christmas.",
		"date": "2022-12-22T00:00:00",
		"comments": []
	},
	{
		"id": 76,
		"title": "Discord RSS relay",
		"content": "I set up a bot in my Discord server to relay posts from here to the announcements channel there. If you want to join, you can do so <a href=/discord>here</a>.",
		"date": "2022-12-14T00:00:00",
		"comments": []
	},
	{
		"id": 75,
		"title": "Christmas 2022 update!",
		"content": "The Christmas 2022 update has arrived!\nA new design, some snow, and some music were added.\nAn audio player for the music can be found at the bottom of whatever page you're looking at (since modern browsers are a pain in the ass with autoplay).\nExpect more major updates very, very soon.\nHave a merry Christmas and happy New Year, when those roll around.",
		"date": "2022-12-05T00:00:00",
		"comments": []
	},
	{
		"id": 74,
		"title": "Discord break",
		"content": "I'm taking a break from Discord. I don't know for how long, but it'll be a while. I'm doing this for my own sanity.\nAnyway, a <a href=/gamesrv/gmod>Garry's Mod server</a> was launched recently. Go check that out.\nTons of visual and nonvisual updates were also added to the site, with a lot more likely on the way.",
		"date": "2022-11-27T00:00:00",
		"comments": []
	},
	{
		"id": 73,
		"title": "New computer + server overhaul",
		"content": "Apologies about the downtime, but 2 big new things.\nI have a new main computer, and I have a new server!.\nI absolutely fucking ADORE the new server setup, it's so fucking fast compared to the old one, plus it's more flexible, and secure. It utilizes Proxmox VE which lets me have each service has it's own VM, greatly improving security with virtually no performance cost. I sound like I'm being paid to say this like some fucking YouTube sponsorship, but I'm serious. I fucking love it.\nSo if you notice everything I host suddenly being a lot faster... well now you know why.\nI've been needing a new computer for a while, and now I have it! I also love this thing!\nOh, and, thanks to <a href=https://dkay.xyz>dkay</a> for helping out with the web server configuration.",
		"date": "2022-11-09T00:00:00",
		"comments": []
	},
	{
		"id": 72,
		"title": "Shitting liquid bricks",
		"content": "I got sick with some kind of stomach bug last night. I feel better today, but still not paticularly well.",
		"date": "2022-10-25T00:00:00",
		"comments": []
	},
	{
		"id": 71,
		"title": "Linux 6.0 out",
		"content": "Linux 6.0 dropped for those running Arch Linux with the testing repos enabled. I installed it about 5 minutes ago from writing this post, so far I haven't had any issues.\nAlso, Windows 11 is a year old today. Damn.",
		"date": "2022-10-05T00:00:00",
		"comments": []
	},
	{
		"id": 70,
		"title": "Halloween 2022... but no update :(",
		"content": "Happy spooky season. I'm currently debating if I should give my site a temporary redesign for October... a bit late for that now but yeah.\nLet me know what you think.",
		"date": "2022-10-02T00:00:00",
		"comments": []
	},
	{
		"id": 69,
		"title": ">:)",
		"content": "Making a blog post just to spite someone.\nAnyway, new shit got added. Check those out.",
		"date": "2022-09-24T00:00:00",
		"comments": []
	},
	{
		"id": 68,
		"title": "HDD death + procrastination = pain",
		"content": "Apologies about the long(er) downtime. The HDD in the server had died, and I put off on replacing it and setting it back up for a week due to schoolwork and lack of motivation, as well as a weird sleep schedule that ties it all together.\nThe new HDD has been working well so far.",
		"date": "2022-09-18T00:00:00",
		"comments": []
	},
	{
		"id": 67,
		"title": "The queen died",
		"content": "So... <a href=https://en.wikipedia.org/wiki/Elizabeth_II>the queen</a> died. I'm... speechless to say the least.\nAnd there's a bunch of idiots joking about it. Well, trolls will be trolls I guess.\n<strong>2023 retrospective</strong>: I'd piss on her grave now lmfao.",
		"date": "2022-09-08T00:00:00",
		"comments": []
	},
	{
		"id": 66,
		"title": "The penguin has died... again",
		"content": "Apologies about the down-time. The install of Fedora running on the server stopped working, and no other Linux distributions would work (including Fedora itself). I had to install Windows on the server just to get it to work, and I spent 2 days configuring everything.\nThe Discord-IRC relay is currently dead due to bugs with Discord.NET on Windows. It's in the process of being replaced by Matterbridge.",
		"date": "2022-09-03T00:00:00",
		"comments": []
	},
	{
		"id": 65,
		"title": "The penguin has died",
		"content": "Apologies about the long downtime. The file system on the server was corrupt and then took a long time to repair.",
		"date": "2022-08-31T00:00:00",
		"comments": []
	},
	{
		"id": 64,
		"title": "Moderate your Minecraft server, folks.",
		"content": "Soooo... my Minecraft server was raided when I was asleep with a bunch of transphobic and racist shit.\nI have an idea of who might've done this, but they keep repeatedly denying it.\nTo prevent this from happening again, I installed CoreProtect and set up a whitelist.",
		"date": "2022-08-28T00:00:00",
		"comments": []
	},
	{
		"id": 63,
		"title": "64 is dead. no 64",
		"content": "I removed the number from my username. I did this because it's much easier for me to say \"HIDEN\" without the number. 64 can be a mouthful to say quickly. :P\nThat HP laptop is in my possession again. It was given back to me after I informed the person I've given it to the that HDD is starting to die (it's S.M.A.R.T. status in CrystalDiskInfo is \"Caution\").\nA thing was added to the homepage called The Stuff Box. It pulls a random thing from a file of 57 other things. It was in testing limbo for a very long time because I didn't know how to implement it... but now I do, and I did it :P.\nOn a semi-related note, fuck CSS.",
		"date": "2022-08-23T00:00:00",
		"comments": []
	},
	{
		"id": 62,
		"title": "HTTP is back + new shit",
		"content": "HTTP was re-enabled on the site for compatibility reasons.\nI still strongly recommend you use HTTPS if you have the option to.\nQuite a few new features are in development (some are implemented in some form already, but not quite ready to be made avaliable on the stable (aka live) instance yet).\nOver the past few weeks I've been focused on getting my life back on track, as well as updating this website with a bunch of major updates. I finally have ideas for them now, and I'm also doing this to make up for the lack of major updates.\nAnyway, I should be getting a new computer soon, probably in a few months at most. I've been having issues with my current one, specifically with crashing at seemingly random intervals. However, this doesn't seem to happen for right now. I've been using Linux Mint for a couple of days now and I haven't had a crash like that.....yet.",
		"date": "2022-08-17T00:00:00",
		"comments": []
	},
	{
		"id": 61,
		"title": "Mental health? What's that?",
		"content": "I'm taking a break from Discord and Twitter. I'm doing this for private reasons and to better my own mental health after something that has happened very recently.",
		"date": "2022-07-31T00:00:00",
		"comments": []
	},
	{
		"id": 60,
		"title": "Dusting this thing off",
		"content": "<em>taps mic</em> Is this thing on?\nYeah, haven't added something here in a while. Sorry about that.\nYou may have noticed, but I have a renewed focus on my YouTube channel, and haven't been updating this site as much as a byproduct.\nI'm trying, effective as of this post, to balance it out. Focus on both equally.\nI'm still out of ideas for major updates. If you have any suggestions, let me know.",
		"date": "2022-07-22T00:00:00",
		"comments": []
	},
	{
		"id": 59,
		"title": "",
		"content": "I'm back on Discord.\nThe break, although very short (only 2 days), was refreshing. I think I'm ready.",
		"date": "2022-07-06T00:00:00",
		"comments": []
	},
	{
		"id": 58,
		"title": "The return no one asked for",
		"content": "I will be coming back to Twitter as of this blog post.\nThe contacts page was re-enabled, however the Discord one is not. I don't feel like I'm ready to come back to Discord yet.\nGood news is, however, I do somewhat feel better about myself, so there's that, I guess.",
		"date": "2022-07-05T00:00:00",
		"comments": []
	},
	{
		"id": 57,
		"title": "Imagine having decent mental health",
		"content": "Effective as of this blog post, I will be taking a break from most social media for a while, for mental health reasons.",
		"date": "2022-07-04T00:00:00",
		"comments": []
	},
	{
		"id": 56,
		"title": "A new computer",
		"content": "A new computer has come into my posession. <br><br> <img class=img2 src=/././static/blog/2022-06-26/image.jpg alt=\"HP Pavilion TS 17 laptop from 2013. Shown in my lap; installing updates on Windows 8.1.\" title=\"HP Pavilion TS 17 laptop from 2013. Shown in my lap; installing updates on Windows 8.1.\"> <br><br>\nThe specs are on the <a href=/computers>computers</a> page.\nIt's an HP Pavilion TS 17-e169nr. It's a hand-me-down that my sister gave to me. Right now, I'm not sure of what to do with it. Maybe I'll use it as a secondary laptop? I don't know. That's how I'm using it right now, I don't know if it's going to stay that way.\nAnother thing I've considered is replacing my crappy server with it, but it seems to run hot very fast in some cases, so I don't know how well that'll play out.\nHell, I'm thinking of throwing Windows Vista on it and using it as some sort of retro gaming machine. I'm conflicted, lol.",
		"date": "2022-06-26T00:00:00",
		"comments": []
	},
	{
		"id": 55,
		"title": "E-Hoarding problem",
		"content": "I installed every version of Windows from 98 - 11, excluding Me, in a VM for testing a bunch of software I have. Just as some experimentation to fuel my data hoarding addiction :P.",
		"date": "2022-06-25T00:00:00",
		"comments": []
	},
	{
		"id": 54,
		"title": "About me overhaul complete + burnout...?",
		"content": "The about me overhaul is complete. It took signaficantly less time than I expected.\nAbout the burnout thing, I don't know anymore. I had fun while making this update, maybe I found that spark again?\nI have no ideas for any more major updates, howerver. I'm open to suggestions. :P",
		"date": "2022-06-22T00:00:00",
		"comments": []
	},
	{
		"id": 53,
		"title": "About me overhaul in progress + burnout",
		"content": "The about me page is being overhauled, being split into multiple pages. As of this post, the contacts page is now it's own page.\nAfter this is done, I'm probably going to take a break from working on this site, because of burnout. I've been disuaded from working on this and other projects because programming is just a mental chore for me right now, and I don't find it fun anymore.\nThese changes are also coming out at a pretty slow pace for the same reason.\nSorry if this dissappoints you, but I want to find what makes programming fun for me again, as well as focus on other things I do that I've neglected (namely video-making).",
		"date": "2022-06-22T00:00:00",
		"comments": []
	},
	{
		"id": 52,
		"title": "Dynmap fixed",
		"content": "Finally resolved the weird problem with the MC Dynmap subdomain. View that <a href=\"https://mc.hiden.pw\">here.</a>\nThe Discord server link was changed to one that doesn't link to the staff chat.",
		"date": "2022-06-16T00:00:00",
		"comments": []
	},
	{
		"id": 51,
		"title": "Birtday (2022, 15)! (cont)",
		"content": "My birthday went really well. One of the things I got from it was a dual monitor setup (I bought a DisplayPort-to-HDMI adapter). Here's what it looks like: <br><br> <img class=img2 src=/static/blog/2022-06-12/image.png alt=\"Image of my dual-montiors setup as of June 12, 2022.\" title=\"Image of my dual-montiors setup as of June 12, 2022.\"> <br><br> So far, it has worked very well. I'm very happy with this.\nI also bought some other things, such as an external 4TB HDD so I don't have to go through partitioning hell when reinstalling OSes.\nAll and all, I'm very happy with how it turned out.",
		"date": "2022-06-12T00:00:00",
		"comments": []
	},
	{
		"id": 50,
		"title": "Birthday (2022, 15)!",
		"content": "Today's my birthday! Hopefully everything goes well.",
		"date": "2022-06-09T00:00:00",
		"comments": []
	},
	{
		"id": 49,
		"title": "It's a blog now",
		"content": "The scope of news has been expanded, and as such it is now a blog.\nThe Minecraft server was updated to version 1.19.\nTomorrow is my birthday. I'll add a new post afterwards. I hope it goes well.",
		"date": "2022-06-08T00:00:00",
		"comments": []
	},
	{
		"id": 48,
		"title": "Old domain gone",
		"content": "The old domain has been shut down as of yesterday. If you have any links to my website, update them now.",
		"date": "2022-05-24T00:00:00",
		"comments": []
	},
	{
		"id": 47,
		"title": "Fedora 36 upgrade + old domain shutting down soon",
		"content": "The server was down from upgrading to Fedora 36 (and me falling asleep before restoring the services).\nThe upgrade went smoothly; I haven't faced any issues so far, besides having to recompile the IRC-Discord relay for .NET 6, due to Fedora 36 not having a package for .NET 5 in it's repos.",
		"date": "2022-05-14T00:00:00",
		"comments": []
	},
	{
		"id": 46,
		"title": "",
		"content": "The site was moved to <a href=\"https://hiden.pw\">a new domain, <em>again</em></a>, courtesy of dkay.\nThe old domain will continue to work as a redirect until May 23, 2022. If you link my site on your own site, please update the link by then.",
		"date": "2022-05-13T00:00:00",
		"comments": []
	},
	{
		"id": 45,
		"title": "What's a mental health?",
		"content": "I'm taking a break from Discord.\nThere is a long list of reasons why, but it's generally because it's been a burden on my mental health, and I need some time away from that mess.\nI'll still speak in some servers via IRC, including WinWorld and mine.",
		"date": "2022-05-03T00:00:00",
		"comments": []
	},
	{
		"id": 44,
		"title": "Six Flags's new rollercoaster",
		"content": "Well, that was a wild few days.\nThis server expldoed, the temporary server exploded due to a MobaXterm feature/bug/whatever, and then everything got fixed. Sorry about all of this, I hope that something like this won't happen again.\nAnyway, yeah. Everything's back up now.",
		"date": "2022-04-25T00:00:00",
		"comments": []
	},
	{
		"id": 43,
		"title": "Distrohopping go br",
		"content": "The server now runs Fedora.",
		"date": "2022-04-22T00:00:00",
		"comments": []
	},
	{
		"id": 42,
		"title": "What the hell even happened here?",
		"content": "Sorry about the downtime. It was caused by a failed upgrade to Linux 5.15 which then spiraled into a hardware failure that somehow fixed itself.\nThe Dynmap for the Minecraft server has been removed for now.",
		"date": "2022-04-20T00:00:00",
		"comments": []
	},
	{
		"id": 41,
		"title": "M o a r buttons",
		"content": "A bunch of new buttons were added. Mostly older ones that have been readded.\nI'm testing a new experiement.",
		"date": "2022-04-19T00:00:00",
		"comments": []
	},
	{
		"id": 40,
		"title": "HTTPS required, nginx caching",
		"content": "HTTPS is now forced, you may use TLSv1 - TLSv1.3. For older browsers you may need to add the <a href=\"https://letsencrypt.org/certs/lets-encrypt-r3.pem\">Let's Encrypt certificate</a> to your browser.\nNginx now caches static content for a more <em>sped</em> browsing experience.\n<em><a href=\"https://dkay.xyz\">dkay</a></em>",
		"date": "2022-04-14T00:00:00",
		"comments": []
	},
	{
		"id": 39,
		"title": "Site now behind a reverse proxy and thus supports HTTPS, service status gone, other things",
		"content": "The site now supports HTTPS (thanks <a href=\"https://dkay.xyz\">dkay</a>).\nHTTP is still avaliable for now while I sort out cipher compatibility with older systems, however I strongly recommend against using it for security and privacy reasons.\nOn top of this, all links that use HTTP and also support HTTPS have been changed to link to the HTTPS version.\nIt is now powered under an Nginx reverse proxy to help achieve this.\nService status was removed because it's a pain to maintain with my current server setup. The best way to know about outages is through my <a href=\"https://discord.gg/zH9kMEzEYM\">my Discord server</a>.\nLinks was rebranded to Places.\nThe site design will change to accomodate holidays (as evident by the April Fools one not too long ago).\nGame servers other than Minecraft is cancelled for now, although I am considering hosting servers of things other than games.\nSorry about the lack of updates. This is pretty much everything that's happened since the last post.",
		"date": "2022-04-13T00:00:00",
		"comments": []
	},
	{
		"id": 38,
		"title": "New project: PubSite",
		"content": "I have a new project available, called PubSite. <a href=\"https://pubsite.cf\">Check it out.</a>\nOn top of that, the site is getting many adjustments to it's appearance and functioanlity. Check those out.",
		"date": "2022-03-28T00:00:00",
		"comments": []
	},
	{
		"id": 37,
		"title": "New shit",
		"content": "An update was just released for the site. A new download was added, some text across the pages was changed, and a few bugs were fixed (the computers link appearing weirdly on Safari and GNOME Web, links pointing to the old domain, old and out of date info, etc).",
		"date": "2022-03-26T00:00:00",
		"comments": []
	},
	{
		"id": 36,
		"title": "Toasty...",
		"content": "Something's on fire! Please wait while I see what the problem is.",
		"date": "2022-03-21T00:00:00",
		"comments": []
	},
	{
		"id": 35,
		"title": "More shit",
		"content": "A <a href=\"/downloads/cursors\">new page</a> is available.\nMany visual adjustments were added.",
		"date": "2022-03-08T00:00:00",
		"comments": []
	},
	{
		"id": 34,
		"title": "Indescisive moment + cleanup + TF2s",
		"content": "News was briefly removed, and then readded.\nThe code is seeing heavy cleanup from unused/nonfunctional things.\nA TF2 server is coming soon.",
		"date": "2022-03-03T00:00:00",
		"comments": []
	},
	{
		"id": 33,
		"title": "Winterization? What's that? Something bees do?",
		"content": "Sorry about the downtime. There was a power outage in my area caused by a winter storm, which took down some power lines.\nThe Downloads page has been revamped.",
		"date": "2022-02-27T00:00:00",
		"comments": []
	},
	{
		"id": 32,
		"title": "Distrohopping!",
		"content": "Sorry about the downtime. I switched the server's OS to Fedora from Ubuntu.",
		"date": "2022-02-18T00:00:00",
		"comments": []
	},
	{
		"id": 31,
		"title": "Things that are no longer existing because... moment",
		"content": "(NO LONGER THE CASE, IT HAS BEEN CANCELLED) <s>I'm opening a Team Fortress 2 server soon.</s>\nThe service status page has been removed for now.\n(NO LONGER THE CASE, THEY WERE SCRAPPED) <s>There's a bunch of pages detailing my favorite crap in development. It's still in the early stages, though. (CANCELLED)</s>\n<s>You can view early, in development stuff, as well as experiements at <a href=\"/dev\">the testing page</a>.</s>\n<s>The pre-release code scattered all over the pages is being reloacated to the afformentioned page.</s>\nAs of 2022-05-09, the testing page is no longer avaliable to the broad public. Dev access (which requires me to personally trust you) or self-hosting the site is now required to access it.",
		"date": "2022-02-10T00:00:00",
		"comments": []
	},
	{
		"id": 30,
		"title": "Some stuff",
		"content": "Quality of life changes and many other improvments were added to many of the pages.",
		"date": "2022-02-07T00:00:00",
		"comments": []
	},
	{
		"id": 29,
		"title": "More",
		"content": "There's a <a href=\"services/gamesrv\">new page</a>.</s>\nMeta (AKA Facebook) has seen their first full-blown user loss on Facebook... good.",
		"date": "2022-02-03T00:00:00",
		"comments": []
	},
	{
		"id": 28,
		"title": "Service status dead",
		"content": "The service status page is permenantly shut down, as I don't have a sufficient host for it.\nThere's also going to be a very bad ice storm in my area later on tonight, so the server will certainly be down for at least 2 - 9 days.\nThe server was restarted due to a Linux kernel update.",
		"date": "2022-02-02T00:00:00",
		"comments": []
	},
	{
		"id": 27,
		"title": "A thing that will NEVER happen",
		"content": "(NO LONGER THE CASE) <s>This site will be rewritten with Bootstrap 5 later on this year.</s>",
		"date": "2022-02-01T00:00:00",
		"comments": []
	},
	{
		"id": 26,
		"title": "Midly painful RAM upgrade",
		"content": "The server was down last night for a hardware upgrade (4GB -> 6GB of RAM), but things didn't exactly go to plan originally. After the upgrade, it only went to a black screen, no beeping, no special lights, no HDD activity, nothing. Reseating both RAM sticks fixed it.\nBecause of that, it was down for much longer than expected. Sorry about that.",
		"date": "2022-01-30T00:00:00",
		"comments": []
	},
	{
		"id": 25,
		"title": "Ahhh, irony is a beautiful thing",
		"content": "Sorry about the long downtime of the service status page (irony), I had to do a reinstallation of both the OS and the Uptime Kuma instance itself.\nApple is deprecating and removing Python 2 in macOS 12.3. Update ya damn code to use Python 3.\nMicrosoft is soon going to cancel Xbox Game Pass subscriptions that haven't been utlizied in a long time, just to avoid draining the bank account of the buyer.\nAnd Google accdidentally confirmed the Pixel 6a. They should, y'know, fix Android 12 before doing something like that.",
		"date": "2022-01-29T00:00:00",
		"comments": []
	},
	{
		"id": 24,
		"title": "Many-a-issue",
		"content": "Sorry about the long downtime. A lot of issues came up in with the server. I was trying to create a systemd service to run the site, but it fails and doesn't tell me why <a href=\"https://github.com/HIDEN64/hidens-website/issues/2\">(more details here)</a>, and then the server had a kernel panic. Hopefully this is the end of this.\nOn the bright side, the server appears to run a lot faster, but this might just be placebo.\nSpotify stock is dropping significantly thanks to them promoting conspiracy theroies. Joe Rogan ramped up his attacks against the COVID-19 vaccine on the platform, and Spotify paid him $100m to do so.\nI can't believe I have to say this on <em>a tech-focused website</em> of all things, but please, get vaccinated and wear a mask. And don't start with that \"THEY DON'T WORK!!!!!1111111111\" bullshit, because they've been proven time and time again to work.",
		"date": "2022-01-27T00:00:00",
		"comments": []
	},
	{
		"id": 23,
		"title": "Reorganization",
		"content": "I'm doing a lot of moving around internally, so sorry if stuff works and/or looks like crap right now.\nThere's now a <a href=\"http://hiden64.ddns.net:3001/status\">service status</a> page, that keeps track of when and why the site and other services I host go down.\nThere's also a ton of new pages in development, plus a planned website rewrite. Which ever comes first is TBD as of now.",
		"date": "2022-01-24T00:00:00",
		"comments": []
	},
	{
		"id": 22,
		"title": "More new shit",
		"content": "Lots of the pages were given an update.\nA new download was added to <a href=\"downloads\">the Downloads page</a>.\nMy contact information is now available on the <a href=\"about\">about me page</a>, in case you ever need to contact me, or just want to have a chat with me.\nThe code of the pages is also being cleaned up quite a bit.",
		"date": "2022-01-23T00:00:00",
		"comments": []
	},
	{
		"id": 21,
		"title": "We win these",
		"content": "Major visual updates were added.\n2 <a href=\"computers\">new</a> <a href=\"about\">pages</a> were added. There will be more new pages soon(tm).\nThe cryptocurrency market has crashed and burned...............\nTIME TO CELEBRATE YAYAYAYAYAAYAYAYAYAY-",
		"date": "2022-01-22T00:00:00",
		"comments": []
	},
	{
		"id": 20,
		"title": "Eye candy",
		"content": "Programs on <a href=\"/downloads/software\">the software downloads page</a> now have icons, so they're more recognizeable. I added a new download for Netscape there too.\nTwitter launched an NFT integration feature...............\nIs there any good alternatives to Twitter?",
		"date": "2022-01-21T00:00:00",
		"comments": []
	},
	{
		"id": 19,
		"title": "Anna discovers margin-auto, more at 11",
		"content": "Added a few more visual updates.\nI'm now utlizing a more efficient way of updating the news and footer without having to manually change the size of those elements.\nThere's a <a href=\"downloads\">new page</a>. This is to help reduce some clutter.\n(NO LONGER THE CASE) <s>The guestbook link was moved to the links (now places) page.</s>\nThe news page has been tweaked visually to help with performance.\nThe blur effect was reduced because it started causing eye strain for me.\nSome parts of the website were tweaked to comply with the W3C standards. I'm not Microsoft.",
		"date": "2022-01-20T00:00:00",
		"comments": []
	},
	{
		"id": 18,
		"title": "Don't use shady DDNS services",
		"content": "<s>I've migrated the site to <a href=\"http://hiden64.ddns.net\">a new domain</a>, because apparently the domain I used before was being flagged as malware by some AVs and websites.</s>\nA lot of visual improvements were slapped onto here too.\nMicrosoft purchased Activision... for whatever reason. They're going to have a total monopoly on gaming in the future just like they do with PCs, I know it.",
		"date": "2022-01-18T00:00:00",
		"comments": []
	},
	{
		"id": 17,
		"title": "Not-so-potential fix for HTTPS",
		"content": "I may have found a fix for HTTPS with this website. If I did, HTTPS will be enabled soon-ish.\nThe new Intel Celeron's single core performance outperforms that of the Core i9-10900K, which is impressive. But of course, it's a Celeron, so it had to be kneecapped in some way. That way is that it's only 2 core, 2 threads. So single core wise, it outperforms the i9-10900K, but for anything multicore, the i9 curb stomps the Celeron.",
		"date": "2022-01-13T00:00:00",
		"comments": []
	},
	{
		"id": 16,
		"title": "Anti-YanDev measures",
		"content": "A new code formatting standard was introduced for this website's code, in an effort to make it organized and not a mess of spaghetti.\nA new page <em>might</em> be coming soon.",
		"date": "2022-01-12T00:00:00",
		"comments": []
	},
	{
		"id": 15,
		"title": "New eye candy things",
		"content": "Many visual updates were added to the site.",
		"date": "2022-01-08T00:00:00",
		"comments": []
	},
	{
		"id": 14,
		"title": "Connection logging",
		"content": "A logging feature was added to this site to monitor the requests, to make sure it's not from bots and/or spammers.",
		"date": "2022-01-07T00:00:00",
		"comments": []
	},
	{
		"id": 13,
		"title": "Internet woes",
		"content": "Happy (late) new year!\nSorry about the extended downtime, I had an issue with my router that wasn't fixed until today.\n(HORIZON IS CANCELLED) <s>Development of Horizon will start back up soon, I took a break from it to focus on other things.</s>",
		"date": "2022-01-05T00:00:00",
		"comments": []
	},
	{
		"id": 12,
		"title": "Rewrite",
		"content": "The site has been rewritten to utilize jinja (an HTML templating engine for Python). The goal with this is to clean up the code, as well as allow for more possibilities than what you can have with just static pages.\nThe actual content of the site is mostly unchanged as of now, but I plan on rewriting the site to utilize Bootstrap in 2022.\nNews now supports RSS.",
		"date": "2021-12-31T00:00:00",
		"comments": []
	},
	{
		"id": 11,
		"title": "Footer e v e r y w h e r e + modernization",
		"content": "The footer now appears on every page.\nThe news page was heavily reworked.\nTables and site logos have been heavily reworked to utilize CSS instead of the archaic in-HTML style definitions.\nMany other visual tweaks have been added.\n<s>The site logo has been updated, as this isn't really a ''90s-designed site'' anymore.</s>\nI'm also cleaning up a bunch of things on the pages themselves, to fix issues and all that jazz.",
		"date": "2021-12-27T00:00:00",
		"comments": []
	},
	{
		"id": 10,
		"title": "Christmas 2021!",
		"content": "Merry Christmas! My gift for this year is the revival of the website after ~1 month of letting it rot. Sorry about that.\nFooter facts have also been removed as they are pretty bloaty and unessecary.",
		"date": "2021-12-25T00:00:00",
		"comments": []
	},
	{
		"id": 9,
		"title": "Halloween 2021!",
		"content": "Happy Halloween! Nothing huge today, just moving around and removing some things; fixing issues with the fonts, removing the RetroSite ad, removing the license (since it's pointless anyway), changing up some text, removing mentions of HM/XPCat besides one footer fact, moving unused images to old stuff, etc. Minor bug fixes too.",
		"date": "2021-10-31T00:00:00",
		"comments": []
	},
	{
		"id": 8,
		"title": "New thing",
		"content": "There's a <a href=\"places\">new page.</a>",
		"date": "2021-10-23T00:00:00",
		"comments": []
	},
	{
		"id": 7,
		"title": "Redesign cancelled",
		"content": "The redesign plan has been shelved. Instead, I'll opt for updating the current design.\n<strong>2023 retrospective</strong>: lol. lmao, even.",
		"date": "2021-10-06T00:00:00",
		"comments": []
	},
	{
		"id": 6,
		"title": "Bits and pieces",
		"content": "I've added some prelimnary parts of the redesign that I was planning for a while.",
		"date": "2021-08-10T00:00:00",
		"comments": []
	},
	{
		"id": 5,
		"title": "TacoBot revival + new link",
		"content": "<s>TacoBot is back.</s> I've also added a new link to the homepage.",
		"date": "2021-08-07T00:00:00",
		"comments": []
	},
	{
		"id": 4,
		"title": "Mucho-shit",
		"content": "New major changes as well as minor changes to the website.\nThe background has been changed, there is now a footer, hyperlinks now have their own colors.\nI also have been squashing some bugs and making some slight tweaks visually.",
		"date": "2021-07-19T00:00:00",
		"comments": []
	},
	{
		"id": 3,
		"title": "Y U G E cleanup",
		"content": "I made a major internal change to most of the webpages here. Most of the code was unorganized and bloated... until today!",
		"date": "2021-07-12T00:00:00",
		"comments": []
	},
	{
		"id": 2,
		"title": "Moved to GitHub pages",
		"content": "<s>This website has moved to a new home. It is now being hosted on GitHub Pages instead of nitrate92/HM's secondary laptop.</s> (Now hosted on my own hardware)",
		"date": "2021-06-26T00:00:00",
		"comments": []
	},
	{
		"id": 1,
		"title": "Now FOSS!",
		"content": "The website is now open source. You can grab the source code <a href=\"https://github.com/hiden64/hidens-website\">here</a>. I am also planning to do a redesign of the site in the future.\nI also cleaned up the home page a bit.",
		"date": "2021-06-22T00:00:00",
		"comments": []
	}
]